# 4.6 Combining and Exporting Data Part  2

### Contents
01 Import Libraries and Data

02 Merge dfprods to df_ordsprods 

03 Export Merged Data to Pickle File

### 01 Import Libraries and Data

3. In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Create path variable for main project folder
path = r'C:\Users\julie_y9025s2\06-2022 Instacart Basket Analysis'

In [3]:
# Use path variable to import 'orders_products_combined.pkl' as df_ordsprods
df_ordsprods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

4. Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [4]:
df_ordsprods.shape

(32434489, 11)

In [5]:
df_ordsprods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

5. Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [6]:
# Use path variable to import products_checked.csv as df_prods
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [7]:
# Check df_prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
# Drop unnecessary 'Unnamed: 0' column
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [9]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
# Discovered that I get an error if I try to merge these data sets.  Decided to test dropping '_merge' column from df_ordsprods
df_ordsprodsdrop = df_ordsprods.drop(columns = ['_merge'])

In [11]:
# Check df_ordsprodsdrop
df_ordsprodsdrop.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0
1,2539329,1,1,2,8,NaN,True,14084,2,0
2,2539329,1,1,2,8,NaN,True,12427,3,0
3,2539329,1,1,2,8,NaN,True,26088,4,0
4,2539329,1,1,2,8,NaN,True,26405,5,0

### 02 Merge dfprods to df_ordsprods

In [12]:
# Merge df_prods to df_ordsprods
df_merged_mega = df_ordsprodsdrop.merge(df_prods, on = 'product_id', indicator = True)

In [13]:
# No error with merge after dropping previous '_merge' column.  View new, merged dataframe df_merged_mega
df_merged_mega.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

6. Confirm the results of the merge using the merge flag.

In [14]:
# Check shape df_merged_mega
df_merged_mega.shape

(32404859, 15)

In [15]:
# Check frequency count for '_merge'
df_merged_mega['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### 03 Export Merged Data to Pickle File

7. Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

In [16]:
# Export df_merged_mega as orders_products_merged in pickle format for speed given size
df_merged_mega.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))